package HW3;

public class P4 {//클래스 선언

	public static void main(String[] args) {//메인으로부터 프로그램시작
		int k30_ii = 12345;// k30_ii라는 숫자형 변수를 정의하고 12345라는 값을 저장
		int k30_j = (k30_ii / 10) * 10;// k30_j라는 숫자형 변수를 정의하고 (k30_ii / 10) * 10이라는 값을 저장
		System.out.printf("#4-1 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12345;// k30_ii라는 숫자형 변수를 정의하고 12345라는 값을 저장
		k30_j = ((k30_ii + 5) / 10) * 10;// k30_j라는 숫자형 변수를 정의하고 ((k30_ii + 5) / 10) * 10이라는 값을 저장
		System.out.printf("#4-2 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12344;// k30_ii라는 숫자형 변수를 정의하고 12344라는 값을 저장
		k30_j = ((k30_ii + 5) / 10) * 10;// k30_j라는 숫자형 변수를 정의하고 ((k3 0_ii + 5) / 10) * 10이라는 값을 저장
		System.out.printf("#4-3 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12350;// k30_ii라는 숫자형 변수를 정의하고 12350라는 값을 저장
		k30_j = ((k30_ii + 50) / 100) * 100;// k30_j라는 숫자형 변수를 정의하고 ((k30_ii + 50) / 100) * 100이라는 값을 저장
		System.out.printf("#4-4 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12340;// k30_ii라는 숫자형 변수를 정의하고 12340라는 값을 저장
		k30_j = ((k30_ii + 50) / 100) * 100;// k30_j라는 숫자형 변수를 정의하고 ((k30_ii + 50) / 100) * 100이라는 값을 저장
		System.out.printf("#4-5 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12500;// k30_ii라는 숫자형 변수를 정의하고 12500라는 값을 저장
		k30_j = ((k30_ii + 500) / 1000) * 1000;// k30_j라는 숫자형 변수를 정의하고 ((k30_ii + 500) / 1000) * 1000이라는 값을 저장
		System.out.printf("#4-6 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		k30_ii = 12400;// k30_ii라는 숫자형 변수를 정의하고 12400라는 값을 저장
		k30_j = ((k30_ii + 500) / 1000) * 1000;// k30_j라는 숫자형 변수를 정의하고 ((k30_ii + 500) / 1000) * 1000이라는 값을 저장
		System.out.printf("#4-7 : %d\n", k30_j);// 변수 k30_j를 화면에 출력
		
		
	}

}
